In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

### concat

In [4]:
pd.concat([india_weather,us_weather])

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

###  concat with continue index

In [5]:
pd.concat([india_weather,us_weather],ignore_index=True)

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2  banglore        78           30
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

In [6]:
## if you want sub-indexing

In [11]:
pd.concat([india_weather,us_weather],keys=['india','usa'])
## whenever index encounter 0 new name from keys is assigned

             city  humidity  temperature
india 0    mumbai        80           32
      1     delhi        60           45
      2  banglore        78           30
usa   0  new york        68           21
      1   chicago        65           14
      2   orlando        75           35

### horizonatal concat or merging

In [17]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore",'chennai'],
    "temperature": [32,45,30,22,],
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30
3   chennai           22

In [18]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [19]:
pd.concat([temperature_df,windspeed_df],axis=1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN
3   chennai           22     NaN        NaN

###  by default concat perform outer join

In [22]:
## to perform inner join

In [23]:
pd.concat([temperature_df,windspeed_df],axis=1,join='inner')

     city  temperature    city  windspeed
0  mumbai           32  mumbai         12
1   delhi           45   delhi          7

In [24]:
##problem with concat

In [26]:
windspeed_df = pd.DataFrame({
    "city": ["chennai","mumbai"],
    "windspeed": [15,12],
})
windspeed_df

      city  windspeed
0  chennai         15
1   mumbai         12

In [27]:
pd.concat([temperature_df,windspeed_df],axis=1)

       city  temperature     city  windspeed
0    mumbai           32  chennai       15.0
1     delhi           45   mumbai       12.0
2  banglore           30      NaN        NaN
3   chennai           22      NaN        NaN

In [28]:
##mumbai got chennai

### The way to do it using concat

In [32]:
pd.concat([temperature_df.set_index('city'),windspeed_df.set_index('city')],axis=1).reset_index()

      index  temperature  windspeed
0  banglore           30        NaN
1   chennai           22       15.0
2     delhi           45        NaN
3    mumbai           32       12.0

### Using merge

In [35]:
pd.merge(temperature_df,windspeed_df,on='city',how='outer',suffixes=('_1','_2'))
##suffixes are useful when both df have same columns

       city  temperature  windspeed
0    mumbai           32       12.0
1     delhi           45        NaN
2  banglore           30        NaN
3   chennai           22       15.0